// Задача 21 - HARD необязательная
// Напишите программу, которая принимает на вход координаты двух точек и 
// находит расстояние между ними в N-мерном пространстве. Сначала задается N с клавиатуры, потом задаются координаты точек.

double Rasst(int[] num1, int[] num2) // ввод ф-ции, определяющей координаты точки
    {
        double res;
        int n = num1.Length;
        int m = num2.Length;
        if (n == m)
            {
                for (int i = 0; i < n; i++)
                {
                    int p = 
                    res = Math.Sqrt(a*a + b*b + c*c);
                }
            }
    }